; domain
(define (domain labyrinth)
(:requirements :adl :action-costs)

(:types
    ;; card with 2 to 4 paths
    card - object
    direction - object
    ;; vertical direction: N S
    directionV - direction
    ;; horizontal directions: W E
    directionH - direction
    ;; values for positions of the card in the grid
    gridpos - object
)

(:constants
    S N - directionV
    W E - directionH
)

(:predicates
    ;; ordering of values for grid positions ?p1 = ?p2 + 1
    (NEXT ?p1 - gridpos ?p2 - gridpos)
    ;; maximal grid index
    (MAX-POS ?p - gridpos)
    ;; minimal grid index
    (MIN-POS ?p - gridpos)
    ;; moving from ?c in direction ?d is blocked by a wall
    (BLOCKED ?c - card ?d - direction)
    ;; robot is located on card ?c
    (robot-at ?c - card)
    ;; card ?c is positioned in the grid at ?x ?y
    (card-at ?c - card ?x - gridpos ?y - gridpos)
    ;; flag indicating that the robot left the maze e.i. that the goal has been reached
    (left)

    ;; flag to indicate that a card is currently moving an the robot cannot move
    (cards-moving)
    ;; flags to indicate that a row/column is rotating in the corresponding direction
    (cards-moving-west)
    (cards-moving-east)
    (cards-moving-south)
    (cards-moving-north)
    ;; the card whose position needs to be updated next while rotating
    (next-moving-card ?c - card)
    ;; the card that was removed to rotate and which needs to be placed at the beginning/end of the row/column
    (new-headtail-card ?c - card)

)

(:functions
    (total-cost) - number
    (move-robot-cost) - number
    (move-card) - number
)

;; moves the robot between to cards
(:action move-west
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionH ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionH)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom w)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?xfrom ?xto)
            (= ?yfrom ?yto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)

(:action move-east
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionH ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionH)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom e)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?xto ?xfrom)
            (= ?yfrom ?yto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)

(:action move-north
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionV ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionV)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom n)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?yfrom ?yto)
            (= ?xfrom ?xto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)

(:action move-south
    :parameters (?cfrom - card ?xfrom - gridpos ?yfrom - gridpos ?dfrom - directionV ?cto - card ?xto - gridpos ?yto - gridpos ?dto - directionV)
    :precondition
        (and
            (not (cards-moving))
            (= ?dfrom s)
            (robot-at ?cfrom)
            (card-at ?cfrom ?xfrom ?yfrom)
            (card-at ?cto ?xto ?yto)
            (next ?yto ?yfrom)
            (= ?xfrom ?xto)
            (not (= ?dfrom ?dto))
            (not (blocked ?cfrom ?dfrom))
            (not (blocked ?cto ?dto))
        )
    :effect
        (and
            (not (robot-at ?cfrom))
            (robot-at ?cto)
            (increase (total-cost) (move-robot-cost))
        )
)


;; there 3 (start, move, stop) for each direction to rotate the cards
;; rotating ends in a deadend if the card with the robot in the row/column that is rotated
;; ----------------------------------------------------------------------------------------

;; starts rotation
;; saves the card with the minimal index
;; determines which card should be updated next the corresponding move action
;; and makes all other actions inapplicable by setting cards-moving and cards-moving-west
(:action start-move-card-west
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-west))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (min-pos ?x)
        (card-at ?cnext ?nextx ?y)
        (next ?nextx ?x)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-west)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

;; updates the grid column index of ?cm which is the next card to update
(:action move-card-west
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos ?prevx - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-west)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?nextx ?y)
        (next ?x ?prevx)
        (next ?nextx ?x)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-west)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

;; stops rotation
;; updates the grid index of the card specified by the start move action in new-headtail-card
(:action stop-move-card-west
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevx - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-west)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next ?x ?prevx)
        (max-pos ?x)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-west))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)


;; ----------------------------------------------------------------------------------------

(:action start-move-card-east
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-east))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (max-pos ?x)
        (card-at ?cnext ?nextx ?y)
        (next ?x ?nextx)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-east)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

(:action move-card-east
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nextx - gridpos ?prevx - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-east)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?nextx ?y)
        (next ?prevx ?x)
        (next ?x ?nextx)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-east)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

(:action stop-move-card-east
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevx - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-east)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next  ?prevx ?x)
        (min-pos ?x)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-east))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?prevx ?y)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)

;; ----------------------------------------------------------------------------------------

(:action start-move-card-north
:parameters(?cm - card ?x - gridpos ?y - gridpos ?cnext - card ?nexty - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-north))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (min-pos ?y)
        (card-at ?cnext ?x ?nexty)
        (next ?nexty ?y)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-north)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

(:action move-card-north
:parameters(?cm - card ?x - gridpos ?y - gridpos  ?cnext - card ?nexty - gridpos ?prevy - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-north)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?x ?nexty)
        (next ?y ?prevy)
        (next ?nexty ?y)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-north)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

(:action stop-move-card-north
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevy - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-north)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next ?y ?prevy)
        (max-pos ?y)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-north))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)

;; ----------------------------------------------------------------------------------------

(:action start-move-card-south
:parameters(?cm - card ?x - gridpos ?y - gridpos  ?cnext - card ?nexty - gridpos)
:precondition
    (and
        (not (cards-moving))
        (not (cards-moving-south))
        (not (robot-at ?cm))
        (card-at ?cm ?x ?y )
        (max-pos ?y)
        (card-at ?cnext ?x ?nexty)
        (next ?y ?nexty)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-south)
        (not (card-at ?cm ?x ?y ))
        (new-headtail-card ?cm)
        (next-moving-card ?cnext)
        (increase (total-cost) (move-card))
    )
)

(:action move-card-south
:parameters(?cm - card ?x - gridpos ?y - gridpos  ?cnext - card ?nexty - gridpos ?prevy - gridpos)
:precondition
    (and
        (cards-moving)
        (cards-moving-south)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (card-at ?cnext ?x ?nexty)
        (next ?prevy ?y)
        (next ?y ?nexty)
    )
:effect
    (and
        (cards-moving)
        (cards-moving-south)
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (not (next-moving-card ?cm))
        (next-moving-card ?cnext)
    )
)

(:action stop-move-card-south
:parameters(?cm - card ?x - gridpos ?y - gridpos ?prevy - gridpos ?newtc - card)
:precondition
    (and
        (cards-moving)
        (cards-moving-south)
        (not (robot-at ?cm))
        (next-moving-card ?cm)
        (card-at ?cm ?x ?y )
        (next ?prevy ?y)
        (min-pos ?y)
        (new-headtail-card ?newtc)
    )
:effect
    (and
        (not (cards-moving))
        (not (cards-moving-south))
        (not (card-at ?cm ?x ?y))
        (card-at ?cm ?x ?prevy)
        (card-at ?newtc ?x ?y)
        (not (new-headtail-card ?newtc))
        (not (next-moving-card ?cm))
    )
)


;; checks whether the robot can leave the labyrinth i.e
;; whether the card the robot is currently on is in the bottom right corner
;; and the rover is in sector SE
(:action leave
:parameters(?c - card ?prow - gridpos ?pcolumn - gridpos)
:precondition
    (and
        (not (cards-moving))
        (robot-at ?c)
        (card-at ?c ?prow ?pcolumn)
        (max-pos ?prow)
        (max-pos ?pcolumn)
        (not (blocked ?c s ))
    )
:effect
    (and
        (left)
    )
)
)

; problem
(define (problem labyrinth-size-7-rotations-2-seed-0)
(:domain labyrinth)
(:objects
	pos0 pos1 pos2 pos3 pos4 pos5 pos6  - gridpos
	card0 card1 card2 card3 card4 card5 card6 card7 card8 card9 card10 card11 card12 card13 card14 card15 card16 card17 card18 card19 card20 card21 card22 card23 card24 card25 card26 card27 card28 card29 card30 card31 card32 card33 card34 card35 card36 card37 card38 card39 card40 card41 card42 card43 card44 card45 card46 card47 card48  - card
)
(:init
	(MAX-POS pos6)
	(MIN-POS pos0)

	(NEXT pos1 pos0)
	(NEXT pos2 pos1)
	(NEXT pos3 pos2)
	(NEXT pos4 pos3)
	(NEXT pos5 pos4)
	(NEXT pos6 pos5)

	(card-at card0 pos0 pos0)
	(card-at card1 pos1 pos0)
	(card-at card2 pos2 pos0)
	(card-at card45 pos3 pos0)
	(card-at card4 pos4 pos0)
	(card-at card5 pos5 pos0)
	(card-at card6 pos6 pos0)
	(card-at card7 pos0 pos1)
	(card-at card8 pos1 pos1)
	(card-at card9 pos2 pos1)
	(card-at card3 pos3 pos1)
	(card-at card11 pos4 pos1)
	(card-at card12 pos5 pos1)
	(card-at card13 pos6 pos1)
	(card-at card20 pos0 pos2)
	(card-at card14 pos1 pos2)
	(card-at card15 pos2 pos2)
	(card-at card10 pos3 pos2)
	(card-at card17 pos4 pos2)
	(card-at card18 pos5 pos2)
	(card-at card19 pos6 pos2)
	(card-at card21 pos0 pos3)
	(card-at card22 pos1 pos3)
	(card-at card23 pos2 pos3)
	(card-at card16 pos3 pos3)
	(card-at card25 pos4 pos3)
	(card-at card26 pos5 pos3)
	(card-at card27 pos6 pos3)
	(card-at card28 pos0 pos4)
	(card-at card29 pos1 pos4)
	(card-at card30 pos2 pos4)
	(card-at card24 pos3 pos4)
	(card-at card32 pos4 pos4)
	(card-at card33 pos5 pos4)
	(card-at card34 pos6 pos4)
	(card-at card35 pos0 pos5)
	(card-at card36 pos1 pos5)
	(card-at card37 pos2 pos5)
	(card-at card31 pos3 pos5)
	(card-at card39 pos4 pos5)
	(card-at card40 pos5 pos5)
	(card-at card41 pos6 pos5)
	(card-at card42 pos0 pos6)
	(card-at card43 pos1 pos6)
	(card-at card44 pos2 pos6)
	(card-at card38 pos3 pos6)
	(card-at card46 pos4 pos6)
	(card-at card47 pos5 pos6)
	(card-at card48 pos6 pos6)

	(BLOCKED card0 N)
	(BLOCKED card0 E)

	(BLOCKED card1 N)
	(BLOCKED card1 W)

	(BLOCKED card2 N)
	(BLOCKED card2 S)

	(BLOCKED card45 E)
	(BLOCKED card45 W)

	(BLOCKED card4 E)

	(BLOCKED card5 W)

	(BLOCKED card6 E)

	(BLOCKED card7 W)

	(BLOCKED card8 N)
	(BLOCKED card8 E)

	(BLOCKED card9 N)

	(BLOCKED card3 N)
	(BLOCKED card3 W)

	(BLOCKED card11 N)
	(BLOCKED card11 S)

	(BLOCKED card12 E)
	(BLOCKED card12 S)

	(BLOCKED card13 E)

	(BLOCKED card20 E)
	(BLOCKED card20 W)

	(BLOCKED card14 N)
	(BLOCKED card14 E)

	(BLOCKED card15 S)
	(BLOCKED card15 W)

	(BLOCKED card10 N)

	(BLOCKED card17 S)

	(BLOCKED card18 N)

	(BLOCKED card19 S)
	(BLOCKED card19 W)

	(BLOCKED card21 E)
	(BLOCKED card21 W)

	(BLOCKED card22 N)
	(BLOCKED card22 S)

	(BLOCKED card23 E)
	(BLOCKED card23 S)


	(BLOCKED card25 E)
	(BLOCKED card25 W)

	(BLOCKED card26 W)

	(BLOCKED card27 E)
	(BLOCKED card27 W)

	(BLOCKED card28 N)
	(BLOCKED card28 W)

	(BLOCKED card29 S)
	(BLOCKED card29 W)

	(BLOCKED card30 S)
	(BLOCKED card30 W)

	(BLOCKED card24 N)

	(BLOCKED card32 N)
	(BLOCKED card32 W)

	(BLOCKED card33 W)

	(BLOCKED card34 E)
	(BLOCKED card34 S)

	(BLOCKED card35 S)
	(BLOCKED card35 W)

	(BLOCKED card36 N)
	(BLOCKED card36 E)

	(BLOCKED card37 W)

	(BLOCKED card31 W)

	(BLOCKED card39 S)
	(BLOCKED card39 W)

	(BLOCKED card40 E)
	(BLOCKED card40 W)

	(BLOCKED card41 N)
	(BLOCKED card41 S)

	(BLOCKED card42 S)

	(BLOCKED card43 N)
	(BLOCKED card43 S)

	(BLOCKED card44 N)

	(BLOCKED card38 S)
	(BLOCKED card38 W)

	(BLOCKED card46 N)
	(BLOCKED card46 S)

	(BLOCKED card47 W)

	(BLOCKED card48 N)
	(BLOCKED card48 E)


	(robot-at card0)

	(= (total-cost) 0)
	(= (move-robot-cost) 1)
	(= (move-card) 1)
)
(:goal
	(and
		(left)
	)
)
	(:metric minimize (total-cost))
)

; plan
1. (start-move-card-north card45 pos3 pos0 card3 pos1)
   deleted: (card-at card45 pos3 pos0)
   added: (cards-moving) (cards-moving-north) (new-headtail-card card45) (next-moving-card card3)
   goals met: 0 of 1
2. (move-card-north card3 pos3 pos1 card10 pos2 pos0)
   deleted: (card-at card3 pos3 pos1) (next-moving-card card3)
   added: (card-at card3 pos3 pos0) (next-moving-card card10)
   goals met: 0 of 1
3. (move-card-north card10 pos3 pos2 card16 pos3 pos1)
   deleted: (card-at card10 pos3 pos2) (next-moving-card card10)
   added: (card-at card10 pos3 pos1) (next-moving-card card16)
   goals met: 0 of 1
4. (move-card-north card16 pos3 pos3 card24 pos4 pos2)
   deleted: (card-at card16 pos3 pos3) (next-moving-card card16)
   added: (card-at card16 pos3 pos2) (next-moving-card card24)
   goals met: 0 of 1
5. (move-card-north card24 pos3 pos4 card31 pos5 pos3)
   deleted: (card-at card24 pos3 pos4) (next-moving-card card24)
   added: (card-at card24 pos3 pos3) (next-moving-card card31)
   goals met: 0 of 1
6. (move-card-north card31 pos3 pos5 card38 pos6 pos4)
   deleted: (card-at card31 pos3 pos5) (next-moving-card card31)
   added: (card-at card31 pos3 pos4) (next-moving-card card38)
   goals met: 0 of 1
7. (stop-move-card-north card38 pos3 pos6 pos5 card45)
   deleted: (cards-moving) (cards-moving-north) (card-at card38 pos3 pos6) (new-headtail-card card45) (next-moving-card card38)
   added: (card-at card38 pos3 pos5) (card-at card45 pos3 pos6)
   goals met: 0 of 1
8. (start-move-card-west card20 pos0 pos2 card14 pos1)
   deleted: (card-at card20 pos0 pos2)
   added: (cards-moving) (cards-moving-west) (new-headtail-card card20) (next-moving-card card14)
   goals met: 0 of 1
9. (move-card-west card14 pos1 pos2 card15 pos2 pos0)
   deleted: (card-at card14 pos1 pos2) (next-moving-card card14)
   added: (card-at card14 pos0 pos2) (next-moving-card card15)
   goals met: 0 of 1
10. (move-card-west card15 pos2 pos2 card16 pos3 pos1)
   deleted: (card-at card15 pos2 pos2) (next-moving-card card15)
   added: (card-at card15 pos1 pos2) (next-moving-card card16)
   goals met: 0 of 1
11. (move-card-west card16 pos3 pos2 card17 pos4 pos2)
   deleted: (card-at card16 pos3 pos2) (next-moving-card card16)
   added: (card-at card16 pos2 pos2) (next-moving-card card17)
   goals met: 0 of 1
12. (move-card-west card17 pos4 pos2 card18 pos5 pos3)
   deleted: (card-at card17 pos4 pos2) (next-moving-card card17)
   added: (card-at card17 pos3 pos2) (next-moving-card card18)
   goals met: 0 of 1
13. (move-card-west card18 pos5 pos2 card19 pos6 pos4)
   deleted: (card-at card18 pos5 pos2) (next-moving-card card18)
   added: (card-at card18 pos4 pos2) (next-moving-card card19)
   goals met: 0 of 1
14. (stop-move-card-west card19 pos6 pos2 pos5 card20)
   deleted: (cards-moving) (cards-moving-west) (card-at card19 pos6 pos2) (new-headtail-card card20) (next-moving-card card19)
   added: (card-at card19 pos5 pos2) (card-at card20 pos6 pos2)
   goals met: 0 of 1
15. (move-south card0 pos0 pos0 s card7 pos0 pos1 n)
   deleted: (robot-at card0)
   added: (robot-at card7)
   goals met: 0 of 1
16. (move-east card7 pos0 pos1 e card8 pos1 pos1 w)
   deleted: (robot-at card7)
   added: (robot-at card8)
   goals met: 0 of 1
17. (move-south card8 pos1 pos1 s card15 pos1 pos2 n)
   deleted: (robot-at card8)
   added: (robot-at card15)
   goals met: 0 of 1
18. (move-east card15 pos1 pos2 e card16 pos2 pos2 w)
   deleted: (robot-at card15)
   added: (robot-at card16)
   goals met: 0 of 1
19. (move-north card16 pos2 pos2 n card9 pos2 pos1 s)
   deleted: (robot-at card16)
   added: (robot-at card9)
   goals met: 0 of 1
20. (move-east card9 pos2 pos1 e card10 pos3 pos1 w)
   deleted: (robot-at card9)
   added: (robot-at card10)
   goals met: 0 of 1
21. (move-east card10 pos3 pos1 e card11 pos4 pos1 w)
   deleted: (robot-at card10)
   added: (robot-at card11)
   goals met: 0 of 1
22. (move-east card11 pos4 pos1 e card12 pos5 pos1 w)
   deleted: (robot-at card11)
   added: (robot-at card12)
   goals met: 0 of 1
23. (move-north card12 pos5 pos1 n card5 pos5 pos0 s)
   deleted: (robot-at card12)
   added: (robot-at card5)
   goals met: 0 of 1
24. (move-east card5 pos5 pos0 e card6 pos6 pos0 w)
   deleted: (robot-at card5)
   added: (robot-at card6)
   goals met: 0 of 1
25. (move-south card6 pos6 pos0 s card13 pos6 pos1 n)
   deleted: (robot-at card6)
   added: (robot-at card13)
   goals met: 0 of 1
26. (move-south card13 pos6 pos1 s card20 pos6 pos2 n)
   deleted: (robot-at card13)
   added: (robot-at card20)
   goals met: 0 of 1
27. (move-south card20 pos6 pos2 s card27 pos6 pos3 n)
   deleted: (robot-at card20)
   added: (robot-at card27)
   goals met: 0 of 1
28. (move-south card27 pos6 pos3 s card34 pos6 pos4 n)
   deleted: (robot-at card27)
   added: (robot-at card34)
   goals met: 0 of 1
29. (move-west card34 pos6 pos4 w card33 pos5 pos4 e)
   deleted: (robot-at card34)
   added: (robot-at card33)
   goals met: 0 of 1
30. (move-south card33 pos5 pos4 s card40 pos5 pos5 n)
   deleted: (robot-at card33)
   added: (robot-at card40)
   goals met: 0 of 1
31. (move-south card40 pos5 pos5 s card47 pos5 pos6 n)
   deleted: (robot-at card40)
   added: (robot-at card47)
   goals met: 0 of 1
32. (move-east card47 pos5 pos6 e card48 pos6 pos6 w)
   deleted: (robot-at card47)
   added: (robot-at card48)
   goals met: 0 of 1
33. (leave card48 pos6 pos6)
   added: (left)
   goals met: 1 of 1
